cf_billing/InformationRegisters/энргСведенияОФайлахДополнительныеРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСведенияОФайлахДополнительныеРеквизиты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТипыПрикрепляемыхФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайл</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСведенияОФайлахДополнительныеРеквизиты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область РегистрацияДанных

// Регистрирует запись.
//
// Параметры:
//  ДанныеДляЗаписи	-	Структура.
//
Процедура ЗарегистрироватьЗапись(ДанныеДляЗаписи) Экспорт 	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеДляЗаписи);
	МенеджерЗаписи.Записать();		
КонецПроцедуры

#КонецОбласти

#Область ПолучениеДанных 

// Получает сведения о файлах.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПолучитьСведенияОФайлах(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 	
	Если Схема = Неопределено Тогда
		Схема  								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСведенияОФайлах());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения; 
	Пакет.ВыбиратьРазрешенные 				= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
		
	Если ПараметрыОтбора.Свойство("Отбор") Тогда
		ДоступныеПараметры 					= "Файл";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, "энргСведенияОФайлахДополнительныеРеквизиты", ПараметрыОтбора.Отбор, ДоступныеПараметры);		
	КонецЕсли;		
КонецПроцедуры  

#КонецОбласти

#Область ВспомогательныеМетоды

// Получает описание объекта.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ПолучитьОписаниеОбъекта() Экспорт
	Возврат энргОбщегоНазначения.ПолучитьОписаниеСвойствРегистра(Метаданные.РегистрыСведений.энргСведенияОФайлахДополнительныеРеквизиты);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаСведенияОФайлах()	
	Текст  =
	"ВЫБРАТЬ
	|	энргСведенияОФайлахДополнительныеРеквизиты.Файл КАК Файл,
	|	энргСведенияОФайлахДополнительныеРеквизиты.ТипФайла КАК ТипФайла,
	|	энргСведенияОФайлахДополнительныеРеквизиты.Номер КАК Номер,
	|	энргСведенияОФайлахДополнительныеРеквизиты.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.энргСведенияОФайлахДополнительныеРеквизиты КАК энргСведенияОФайлахДополнительныеРеквизиты";
	
	Возврат Текст;	
КонецФункции

#КонецОбласти

#КонецЕсли
